int main()
{
	int g1 = 0;
	int *f1 = &g1;
	int **e1[5][5]; //二维数组，每个元素是一个最终指向int的二阶指针
	e1[0][0] = &f1; 
	**e1[0][0] = 2;//printf(g1) is 2
	int g2[5] = {};
	int (*f2[5])[5]; //f2是一个数组，每个元素是指针，指针指向一个数组
	f2[0] = &g2;
	int (*(*e2)[5])[5] =&f2 ; //e2是一个指针，指向一个元素个数为5的数组，该数组的每一个元素是一个指向元素个数为5的数组的指针
	int (*e3[5][5])[5]; //e3是一个二维数组，每个元素是一个指针，指向一位数组的指针
	e2 = e3; //Correct
	// e3 = e2 //Incorrect'
	int (*(e4[5])[5])[5]; //类型完全等同e3
	//e4[0][0] = &e2; // Incorrect
	//
	int ***b1,***c1;
	int **b2[5], **c2[4];
	int *(*b3)[5], *(*c3)[4]; 
	int (**b4)[5], (**c4)[4];
	int *b5[5][5], *c5[4][5], *c6[5][4], *c7[4][4]; 
	int (*b6)[5][5], (*c8)[4][5], (*c9)[5][4], (*c10)[4][4]; 
	int (*b7[5])[5], (*c11[4])[5], (*c12[5])[4], (*c13[4])[4];
	int b8[5][5][5], c14[4][5][5], c15[5][4][5], c16[5][5][4];
	int ****a1;
	int ***a2[5];
	int **(*a3)[5];
	int *(**a4)[5]; 
	int (***a5)[5]; 
	int **a6[5][5]; 
	int *(*a7)[5][5]; 
	int (**a8)[5][5]; 
	int *(*a9[5])[5]; 
	int (**a10[5])[5]; 
	int (*(*a11)[5])[5];
	int *a12[5][5][5]; 
	int (*a13)[5][5][5]; 
	int (*a14[5])[5][5]; 
	int (*a15[5][5])[5];
	int a16[5][5][5][5];
	
	a1 = &b1; a3 = &b2; a4 = &b3; a5 = &b4;
	a7 = &b5; a8 = &b6; a11 = &b7;  a13 = &b8;
	a1 = a1; a1 = a2; a3 = a3; a3 = a6;
	a4 = a4; a4 = a9; a5 = a5; a5 = a10;
	a7 = a7; a7 = a12; a8 = a8; a8 = a14;
	a11 = a11; a11 = a15; a13 = a13; a13 = a16;

	a1 = &c1; //Other arrangement is not avaliable
}
